
public class Task08 {

	//编写一个main方法
	public static void main(String[] args) {

		/*
		 求出1-1/2+1/3-1/4+...-1/100的和
		 思路分析
		 1. 1-1/2+1/3-1/4+...-1/100 = (1/1)-(1/2)+(1/3)-(1/4)...(1/100)
		 2. 
		 (1) 个数是100,分子为1,分母为1-100
		 (2) 还发现当分母为奇数时,符号是+,当分母为偶数时,符号是-
		 3. 可以使用for和判断完成 
		 4. 把结果保存到double sum
		 5. 这里有一个trap,要将1写成1.0得到精确的小数
		*/
		double sum = 0;
		for (int i = 1; i <= 100; i++) {
			// 判断是第奇数个还是偶数个，分别处理
			if (i % 2 != 0) {
				sum += 1.0 / i;
			} else {
				sum -= 1.0 / i;
			}
		}
		System.out.println("结果是" + sum);
	}
}